{
    "home": {
        "title": "Ádám Gábor Németh",
        "description": "Hi, I’m Adam—a Python developer based in Moscow, Russia. I specialize in automating traditional design workflows using modern technologies. When I’m not coding, you’ll find me tinkering with CAD designs, 3D printing, hacking on IoT projects, or building things in my workshop.",
        "buttons": [
            "About",
            "IT projects",
            "Engineering projects"
        ]
    },
    "about": {
        "title": "About",
        "content": [
            "Hello, I'm Ádám Gábor Németh - a Python developer specializing in automation. I'm working on microservice-based solutions for automated interior design and 3D rendering pipelines. Additionally, I'm building an interactive portfolio platform with real-time 3D model generation.",
            "I graduated as a mechanical engineer from the Budapest University of Technology and Economics where I specialized in manufacturing automation. With time, I understood, that if I really want to keep step with the technological progress, I need to learn about neural networks and start using them in my projects. Therefore I completed a course at an <a href = 'https://neural-university.com' target='_blank'>online university</a>, with wrote a diploma project in the field of computer vision."
        ],
        "image": "assets/images/aboutAGN.jpg"
    },
    "it_projects": {
        "title": "Projects",
        "intro": "This is a selection of my AI projects. Some of which are ongoing.",
        "projects": [
            {
                "title": "Robot with computer vision – Picture segmentation",
                "description": "On the first picture you can see the robot which is used in my picture segmentation project. After that you can see some illustrations on how correctly and precisely the created neural network (U-net architecture) is working.",
                "images": [
                    "assets/images/AI/diplomproject.png"
                ],
                "link": "https://github.com/AGNworks/CarCam_NN",
                "linkText": "View Source Code"
            },
            {
                "title": "AI Security – Visual weapon detection",
                "description": "In this internship project we created a neural network to detect a weapon with high precision on a frame from a security camera. We created this project based on YOLOv8 architecture, and we created an API server (NestJS) for the implementation.",
                "images": [
                    "assets/images/AI/gundetection.jpg"
                ]
            },
            {
                "title": "Work scheduling with AI – Attendance tracking",
                "description": "With this development we can make a smart camera from the already installed security cameras in an office or manufacturing space. The working process of this system is the following: the model gets a frame from the camera, there are people on the frame who were not detected before on that day, the system adds this information to a table as arrival time. At the end of the workday if an employee is not detected anymore then the time of his last appearance will be added as the time of leaving.",
                "images": [
                    "assets/images/AI/office_small.jpg"
                ],
                "link": "https://github.com/AGNworks/Office-people-recognition"
            }
        ]
    },
    "more_projects": {
        "title": "More Projects",
        "intro": "The following projects are various work assignments and hobby projects I worked on in collaboration with other professionals.",
        "projects": [
            {
                "title": "DMX-512 controller on Raspberry Pi",
                "description": "I created this gadget to test the lighting systems (DMX-512 protocol) easier and faster. I draw the case in Fusion360 and printed the elements on 3D printer from PETG plastic. The system works with Raspberry Pi, with Raspbian installed on it, and an Arduino nano, which is transferring the signal with the help of RS485 module.",
                "images": [
                    "assets/images/more/dmx1.jpg"
                ],
                "link": "https://github.com/AGNworks/Raspberry_DMX_Controller",
                "linkText": "More information"
            },
            {
                "title": "Wireless bottle for theatre performance",
                "description": "We created this interesting bottle for a theatre performance, where a champagne bottle needed to be opened remotely, without human help. When the button on the remote is pressed, a valve is releasing compressed air and the cork flies out of the bottle. The bottle is printed with 3D printer, the code for the remote operation was written in C++ for the bottle and the remote.",
                "images": [
                    "assets/images/more/cham.jpg"
                ]
            },
            {
                "title": "DMX-512 controller on Nodemcu",
                "description": "This is a more compact version of a DMX-512 controller, working from battries 18650, and creating a hotspot for the controlling interface. We can connect with our phone and open the correct IP address. The code for this is written in C++, and it is running on a NodeMCU microcontroller.",
                "images": [
                    "assets/images/more/dmx2.jpg"
                ],
                "link": "https://github.com/AGNworks/Controller-on-NodeMcu-v3"
            },
            {
                "title": "50th Birthday Party",
                "description": "We made this project with colleagues at work. The number 50 is formed from segments hanging on different rods. All of the rods are connected with timing belt, it makes 360-degree turns than stops every time the number is in the correct position. In this project I used some sensors to check the position of the rods. The brain of this project is a microcontroller, programmed in C++.",
                "images": [
                    "assets/images/more/50.jpg"
                ]
            },
            {
                "title": "Filament dryer for 3D printing",
                "description": "My friend asked me to create a controlling system for his DIY filament dryer. I made a self-controlling heating system with the possibility to set up the process parameters. Here I used a temperature sensor, Arduino nano, OLED display and an encoder for navigating in the menu. Also written in C++.",
                "images": [
                    "assets/images/more/dryer.jpg"
                ],
                "link": "https://github.com/AGNworks/Filament_dryer"
            },
            {
                "title": "Interactive Busyboard - Moscow Urban Forum 2022",
                "description": "This project is a game for children, where they can move a puppet on a field. At different stages different effects occur (windows in buildings light up etc.). For this I used a microcontroller, SPI LED strips and some sensors.",
                "images": [
                    "assets/images/more/urbanforum.jpg"
                ]
            },
            {
                "title": "Foot keyboard",
                "description": "I created this foot-keyboard for my engineer friend to be able to work faster in AutoCad. With this device you can use a duplicate of 3 regular keyboard buttons and press them with your feet.",
                "images": [
                    "assets/images/more/foot_keys_2.JPG"
                ],
                "link": "https://github.com/AGNworks/Foot_keys"
            },
            {
                "title": "Frozen clock for theatre performance",
                "description": "All the wheels of this decoration are turning with different speed, and it has a remote-controlled start system. I designed the electrical and the electro-mechanical parts of this project. Other professionals checked it and contributed during the assembly process.",
                "images": [
                    "assets/images/more/taleofnorth.jpg"
                ]
            },
            {
                "title": "LED flowers for dancing show in Doha 2020",
                "description": "We delivered 52 pcs of wireless LED flowers for dancing show in Doha. It is supplied from a LiPo battery and controlled wirelessly via DMX-512 protocol. I designed the electrical parts of the flowers and participated in the assembly process. I travelled with them to Katar to give tech support in case of need. (Another interesting challenge was the packing, transporting and re-assembly of these huge elements via regular commercial flight.)",
                "images": [
                    "assets/images/more/katar_flowers.jpg"
                ]
            },
            {
                "title": "Theatre performance -Laurel-",
                "description": "We installed a huge decoration with lots of lighting features, all of them are working on the protocol with DMX-512. I designed and controlled the assembly process of the electrical parts of this project and created a controlling system for the 26 electric blinds on the front side of the construction.",
                "images": [
                    "assets/images/more/mxat.jpg"
                ]
            },
            {
                "title": "Anniversary -Главкино- 2021",
                "description": "We created two huge fans (diameters 5m and 7m) for Главкино. I designed the speed controlling system and participated in the designing process of the mechanical parts of this project.",
                "images": [
                    "assets/images/more/kino.jpg"
                ]
            },
            {
                "title": "Theatre performance -Бессмертный голос-",
                "description": "We designed and created a reusable lighting device which can be connected to a system working on the DMX-512 protocol. They can be assembled in many different ways to get different shapes. We made most parts of the device with a 3D printer. I designed the electrical part of this project and some of the elements of the moving mechanical parts.",
                "images": [
                    "assets/images/more/immortalvoice.jpg"
                ]
            }
        ]
    }
}