{
    "home": {
        "title": "Адам Габор Немет",
        "description": "Привет, я Адам, инженер по машинному обучению, живу в Москве. Я увлекаюсь компьютерным зрением и классической инженерией. Хочу делиться этой страстью, работая с единомышленниками, воплощая ваши проекты в жизнь.",
        "buttons": [
            "Обо мне",
            "Проекты",
            "Другие проекты"
        ]
    },
    "about": {
        "title": "Обо мне",
        "content": [
            "Привет, меня зовут Адам Габор Немет. Я инженер по машинному обучению, работающий над проектами как в виртуальном, так и в физическом мире.",
            "Я окончил Будапештский университет технологии и экономики по специальности 'механический инженер' со специализацией в автоматизации производства. Со временем я понял, что чтобы идти в ногу с технологическим прогрессом, мне нужно изучать нейронные сети и использовать их в своих проектах. Поэтому я прошел курс в <a href = 'https://neural-university.com' target='_blank'>онлайн-университете</a> и написал <a href='https://github.com/AGNworks/CarCam_NN' target='_blank'>дипломный проект</a> в области компьютерного зрения."
        ],
        "image": "assets/images/aboutAGN.jpg"
    },
    "it_projects": {
        "title": "Проекты",
        "intro": "Это подборка моих проектов в области ИИ. Некоторые из них все еще в разработке.",
        "projects": [
            {
                "title": "Робот с компьютерным зрением – Сегментация изображений",
                "description": "На первом фото вы можете увидеть робота, используемого в моем проекте по сегментации изображений. Также показаны примеры того, насколько точно работает созданная нейронная сеть (архитектура U-net).",
                "images": [
                    "assets/images/AI/diplomproject.png"
                ],
                "link": "https://github.com/AGNworks/CarCam_NN",
                "linkText": "Исходный код"
            },
            {
                "title": "Безопасность с ИИ – Детекция оружия",
                "description": "В этом проекте во время стажировки мы создали нейронную сеть для точного обнаружения оружия на кадрах с камер наблюдения. Проект основан на архитектуре YOLOv8, и мы разработали API-сервер (NestJS) для его реализации.",
                "images": [
                    "assets/images/AI/gundetection.jpg"
                ]
            },
            {
                "title": "Планирование рабочего времени с ИИ – Учет посещаемости",
                "description": "С этой разработкой мы можем превратить обычные камеры наблюдения в офисе или производственном помещении в 'умные' камеры. Система работает следующим образом: модель получает кадр с камеры, обнаруживает людей, которые не отмечались ранее в этот день, и добавляет эту информацию в таблицу как время прихода. В конце рабочего дня, если сотрудник больше не обнаруживается, время его последнего появления записывается как время ухода.",
                "images": [
                    "assets/images/AI/office_small.jpg"
                ],
                "link": "https://github.com/AGNworks/Office-people-recognition"
            }
        ]
    },
    "more_projects": {
        "title": "Другие проекты",
        "intro": "Эти проекты представляют собой различные рабочие задания и хобби-проекты, выполненные в сотрудничестве с другими специалистами.",
        "projects": [
            {
                "title": "Контроллер DMX-512 на Raspberry Pi",
                "description": "Я создал это устройство для более удобного и быстрого тестирования систем освещения (протокол DMX-512). Корпус был спроектирован в Fusion360 и напечатан на 3D-принтере из PETG пластика. Система работает на Raspberry Pi с установленной Raspbian и Arduino Nano, который передает сигнал с помощью модуля RS485.",
                "images": [
                    "assets/images/more/dmx1.jpg"
                ],
                "link": "https://github.com/AGNworks/Raspberry_DMX_Controller",
                "linkText": "Подробнее"
            },
            {
                "title": "Беспроводная бутылка для театральной постановки",
                "description": "Мы создали эту необычную бутылку для театральной постановки, где нужно было открывать шампанское дистанционно, без участия человека. При нажатии кнопки на пульте клапан выпускает сжатый воздух, и пробка вылетает из бутылки. Бутылка напечатана на 3D-принтере, а код для дистанционного управления написан на C++.",
                "images": [
                    "assets/images/more/cham.jpg"
                ]
            },
            {
                "title": "Контроллер DMX-512 на NodeMCU",
                "description": "Это более компактная версия контроллера DMX-512, работающая от батарей 18650 и создающая точку доступа для интерфейса управления. Мы можем подключиться с телефона и открыть соответствующий IP-адрес. Код написан на C++ и работает на микроконтроллере NodeMCU.",
                "images": [
                    "assets/images/more/dmx2.jpg"
                ],
                "link": "https://github.com/AGNworks/Controller-on-NodeMcu-v3"
            },
            {
                "title": "Юбилей - 50 лет",
                "description": "Мы сделали этот проект с коллегами по работе. Цифра 50 состоит из сегментов, подвешенных на разных стержнях. Все стержни соединены зубчатым ремнем, который делает оборот на 360 градусов и останавливается, когда цифра находится в правильном положении. В этом проекте я использовал датчики для проверки положения стержней. 'Мозгом' проекта является микроконтроллер, запрограммированный на C++.",
                "images": [
                    "assets/images/more/50.jpg"
                ]
            },
            {
                "title": "Сушилка для филамента для 3D-печати",
                "description": "Мой друг попросил меня создать систему управления для его самодельной сушилки для филамента. Я сделал саморегулируемую систему нагрева с возможностью настройки параметров процесса. В проекте использовались датчик температуры, Arduino Nano, OLED-дисплей и энкодер для навигации по меню. Код также написан на C++.",
                "images": [
                    "assets/images/more/dryer.jpg"
                ],
                "link": "https://github.com/AGNworks/Filament_dryer"
            },
            {
                "title": "Интерактивная доска - Московский урбанистический форум 2022",
                "description": "Этот проект представляет собой игру для детей, где они могут перемещать куклу по полю. На разных этапах происходят различные эффекты (например, загораются окна в зданиях). Для этого я использовал микроконтроллер, SPI LED-ленты и некоторые датчики.",
                "images": [
                    "assets/images/more/urbanforum.jpg"
                ]
            },
            {
                "title": "Ножная клавиатура",
                "description": "Я создал эту ножную клавиатуру для моего друга-инженера, чтобы он мог работать быстрее в AutoCad. С этим устройством можно использовать дубликаты 3 обычных клавиш клавиатуры и нажимать их ногами.",
                "images": [
                    "assets/images/more/foot_keys_2.JPG"
                ],
                "link": "https://github.com/AGNworks/Foot_keys"
            },
            {
                "title": "Замороженные часы для театральной постановки",
                "description": "Все колеса этой декорации вращаются с разной скоростью, и у нее есть дистанционная система запуска. Я разработал электрические и электромеханические части этого проекта. Другие специалисты проверили и помогли собрать конструкцию.",
                "images": [
                    "assets/images/more/taleofnorth.jpg"
                ]
            },
            {
                "title": "Светодиодные цветы для танцевального шоу в Дохе 2020",
                "description": "Мы изготовили 52 беспроводных светодиодных цветка для танцевального шоу в Дохе. Они питаются от LiPo-аккумуляторов и управляются по протоколу DMX-512. Я разработал электрическую часть цветов и участвовал в их сборке. Я сопровождал их в Катар для технической поддержки. (Отдельной задачей была упаковка, транспортировка и повторная сборка этих крупных элементов обычным авиарейсом.)",
                "images": [
                    "assets/images/more/katar_flowers.jpg"
                ]
            },
            {
                "title": "Театральная постановка -Лавр-",
                "description": "Мы установили огромную декорацию с множеством световых эффектов, работающих по протоколу DMX-512. Я разработал и контролировал процесс сборки электрической части проекта и создал систему управления для 26 электрических жалюзи на фасаде конструкции.",
                "images": [
                    "assets/images/more/mxat.jpg"
                ]
            },
            {
                "title": "Юбилей -Главкино- 2021",
                "description": "Мы создали два огромных вентилятора (диаметром 5м и 7м) для Главкино. Я разработал систему управления скоростью и участвовал в проектировании механической части.",
                "images": [
                    "assets/images/more/kino.jpg"
                ]
            },
            {
                "title": "Театральная постановка -Бессмертный голос-",
                "description": "Мы разработали и создали многоразовое осветительное устройство, которое можно подключить к системе, работающей по протоколу DMX-512. Его можно собирать разными способами для получения различных форм. Большинство деталей устройства были напечатаны на 3D-принтере. Я разработал электрическую часть проекта и некоторые элементы движущихся механических частей.",
                "images": [
                    "assets/images/more/immortalvoice.jpg"
                ]
            }
        ]
    }
}